Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.8/XCVR/MKW36Z4/cfgs_kw4x_3x_2x/fsl_xcvr_common_config.c
    .agc_gain_tbl_19_16_init = XCVR_RX_DIG_AGC_GAIN_TBL_19_16_LNA_GAIN_16(6) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_19_16_BBA_GAIN_16(6) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_19_16_LNA_GAIN_17(6) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_19_16_BBA_GAIN_17(7) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_19_16_LNA_GAIN_18(7) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_19_16_BBA_GAIN_18(6) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_19_16_LNA_GAIN_19(7) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_19_16_BBA_GAIN_19(7),

    .agc_gain_tbl_23_20_init = XCVR_RX_DIG_AGC_GAIN_TBL_23_20_LNA_GAIN_20(8) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_23_20_BBA_GAIN_20(6) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_23_20_LNA_GAIN_21(8) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_23_20_BBA_GAIN_21(7) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_23_20_LNA_GAIN_22(9) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_23_20_BBA_GAIN_22(6) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_23_20_LNA_GAIN_23(9) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_23_20_BBA_GAIN_23(7),

    .agc_gain_tbl_26_24_init = XCVR_RX_DIG_AGC_GAIN_TBL_26_24_LNA_GAIN_24(9) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_26_24_BBA_GAIN_24(8) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_26_24_LNA_GAIN_25(9) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_26_24_BBA_GAIN_25(9) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_26_24_LNA_GAIN_26(9) |
                               XCVR_RX_DIG_AGC_GAIN_TBL_26_24_BBA_GAIN_26(10),
    
    .rssi_ctrl_0_init = XCVR_RX_DIG_RSSI_CTRL_0_RSSI_USE_VALS(1) |
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_HOLD_SRC(0) |
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_HOLD_EN(1) |
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_IIR_CW_WEIGHT(0) |
#if !RADIO_IS_GEN_2P1
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_N_WINDOW_AVG(1) |
#else
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_N_WINDOW_NB(1) |
#endif /* !RADIO_IS_GEN_2P1 */
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_HOLD_DELAY(4) |
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_IIR_WEIGHT(3) |
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_VLD_SETTLE(3) |
                        XCVR_RX_DIG_RSSI_CTRL_0_RSSI_ADJ(0xE8) ,

    .cca_ed_lqi_ctrl_0_init = XCVR_RX_DIG_CCA_ED_LQI_CTRL_0_LQI_CORR_THRESH(0) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_0_CORR_CNTR_THRESH(0) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_0_LQI_CNTR(0x1A) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_0_SNR_ADJ(0),

    .cca_ed_lqi_ctrl_1_init = XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_RSSI_NOISE_AVG_DELAY(0) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_RSSI_NOISE_AVG_FACTOR(0) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_LQI_RSSI_WEIGHT(0x4) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_LQI_RSSI_SENS(0x7) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_SNR_LQI_DIS(0) |
#if !RADIO_IS_GEN_2P1
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_SEL_SNR_MODE(0) |
#endif /* !RADIO_IS_GEN_2P1 */
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_MEAS_TRANS_TO_IDLE(0) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_CCA1_ED_EN_DIS(0) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_MAN_MEAS_COMPLETE(0) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_MAN_AA_MATCH(0) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_SNR_LQI_WEIGHT(0x5) |
                              XCVR_RX_DIG_CCA_ED_LQI_CTRL_1_LQI_BIAS(0x2),

    /* XCVR_TSM configs */
    .tsm_ctrl = XCVR_TSM_CTRL_PA_RAMP_SEL(PA_RAMP_SEL) |
                XCVR_TSM_CTRL_DATA_PADDING_EN(DATA_PADDING_EN) |
                XCVR_TSM_CTRL_TSM_IRQ0_EN(0) |
                XCVR_TSM_CTRL_TSM_IRQ1_EN(0) |
                XCVR_TSM_CTRL_RAMP_DN_DELAY(0x4) |
                XCVR_TSM_CTRL_TX_ABORT_DIS(0) |
                XCVR_TSM_CTRL_RX_ABORT_DIS(0) |
                XCVR_TSM_CTRL_ABORT_ON_CTUNE(0) |
                XCVR_TSM_CTRL_ABORT_ON_CYCLE_SLIP(0) |
                XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG(0) |
                XCVR_TSM_CTRL_BKPT(0xFF) ,

    .tsm_ovrd2_init = XCVR_TSM_OVRD2_FREQ_TARG_LD_EN_OVRD(0) | XCVR_TSM_OVRD2_FREQ_TARG_LD_EN_OVRD_EN_MASK,
#if RADIO_IS_GEN_2P0
    .end_of_seq_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(END_OF_RX_WU_26MHZ) | B1(END_OF_TX_WD) | B0(END_OF_TX_WU),
#else
    .end_of_seq_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(END_OF_RX_WU_26MHZ) | B1(END_OF_TX_WD) | B0(END_OF_TX_WU+1),
#endif
    .end_of_seq_init_32mhz = B3(END_OF_RX_WD) | B2(END_OF_RX_WU) | B1(END_OF_TX_WD) | B0(END_OF_TX_WU),

#if !RADIO_IS_GEN_2P1
    .lpps_ctrl_init = B3(102) | B2(40) | B1(0) | B0(0),
#endif /* !RADIO_IS_GEN_2P1 */

    .tsm_fast_ctrl2_init_26mhz = B3(102 + ADD_FOR_26MHZ) | B2(40 + ADD_FOR_26MHZ) | B1(66) | B0(8),
    .tsm_fast_ctrl2_init_32mhz = B3(102) | B2(40) | B1(66) | B0(8),

#if RADIO_IS_GEN_2P1
    .pa_ramp_tbl_0_init = XCVR_TSM_PA_RAMP_TBL0_PA_RAMP0(PA_RAMP_0) | XCVR_TSM_PA_RAMP_TBL0_PA_RAMP1(PA_RAMP_1) |
                            XCVR_TSM_PA_RAMP_TBL0_PA_RAMP2(PA_RAMP_2) | XCVR_TSM_PA_RAMP_TBL0_PA_RAMP3(PA_RAMP_3),
    .pa_ramp_tbl_1_init = XCVR_TSM_PA_RAMP_TBL1_PA_RAMP4(PA_RAMP_4) | XCVR_TSM_PA_RAMP_TBL1_PA_RAMP5(PA_RAMP_5) |
                            XCVR_TSM_PA_RAMP_TBL1_PA_RAMP6(PA_RAMP_6) | XCVR_TSM_PA_RAMP_TBL1_PA_RAMP7(PA_RAMP_7),
    .pa_ramp_tbl_2_init = XCVR_TSM_PA_RAMP_TBL2_PA_RAMP8(PA_RAMP_8) | XCVR_TSM_PA_RAMP_TBL2_PA_RAMP9(PA_RAMP_9) |
                            XCVR_TSM_PA_RAMP_TBL2_PA_RAMP10(PA_RAMP_10) | XCVR_TSM_PA_RAMP_TBL2_PA_RAMP11(PA_RAMP_11),
    .pa_ramp_tbl_3_init = XCVR_TSM_PA_RAMP_TBL3_PA_RAMP12(PA_RAMP_12) | XCVR_TSM_PA_RAMP_TBL3_PA_RAMP13(PA_RAMP_13) |
                            XCVR_TSM_PA_RAMP_TBL3_PA_RAMP14(PA_RAMP_14) | XCVR_TSM_PA_RAMP_TBL3_PA_RAMP15(PA_RAMP_15),
    .recycle_count_init_26mhz = B3(0) | B2(0x1C+ADD_FOR_26MHZ) | B1(0x06) | B0(0x66+ADD_FOR_26MHZ),
    .recycle_count_init_32mhz = B3(0) | B2(0x1C) | B1(0x06) | B0(0x66),


    /* Apply 32MHz or 26MHz timing baseline to all timings, in spite of the naming */
    .tsm_timing_00_init =       TSM_TIMING00init, /* bb_ldo_hf_en */
    .tsm_timing_01_init =       TSM_TIMING01init, /* bb_ldo_adcdac_en */
    .tsm_timing_02_init =       TSM_TIMING02init, /* bb_ldo_bba_en */
    .tsm_timing_03_init =       TSM_TIMING03init, /* bb_ldo_pd_en */
    .tsm_timing_04_init =       TSM_TIMING04init, /* bb_ldo_fdbk_en */
    .tsm_timing_05_init =       TSM_TIMING05init, /* bb_ldo_vcolo_en */
    .tsm_timing_06_init =       TSM_TIMING06init, /* bb_ldo_vtref_en */
    .tsm_timing_07_init =       TSM_TIMING07init, /* bb_ldo_fdbk_bleed_en */
    .tsm_timing_08_init =       TSM_TIMING08init, /* bb_ldo_vcolo_bleed_en */
    .tsm_timing_09_init =       TSM_TIMING09init, /* bb_ldo_vcolo_fastcharge_en */
    
    .tsm_timing_10_init =       TSM_TIMING10init, /* bb_xtal_pll_ref_clk_en */
    .tsm_timing_11_init =       TSM_TIMING11init, /* bb_xtal_dac_ref_clk_en */
    .tsm_timing_12_init =       TSM_TIMING12init, /* rxtx_auxpll_vco_ref_clk_en */
    .tsm_timing_13_init =       TSM_TIMING13init, /* sy_vco_autotune_en */
    .tsm_timing_14_init_32mhz = TSM_TIMING14init,
    .tsm_timing_15_init =       TSM_TIMING15init, /* sy_vco_en */
    .tsm_timing_16_init_32mhz = TSM_TIMING16init,
    .tsm_timing_17_init =       TSM_TIMING17init, /* sy_lo_tx_buf_en */
    .tsm_timing_18_init =       TSM_TIMING18init, /* sy_divn_en */
    .tsm_timing_19_init =       TSM_TIMING19init, /* sy_pd_filter_charge_en */
    
    .tsm_timing_20_init =       TSM_TIMING20init, /* sy_pd_en */
    .tsm_timing_21_init =       TSM_TIMING21init, /* sy_lo_divn_en */
    .tsm_timing_22_init =       TSM_TIMING22init, /* sy_lo_rx_en */
    .tsm_timing_23_init =       TSM_TIMING23init, /*sy_lo_tx_en  */
    .tsm_timing_24_init =       TSM_TIMING24init, /* sy_divn_cal_en */
    .tsm_timing_25_init_32mhz = TSM_TIMING25init,
    .tsm_timing_26_init =       TSM_TIMING26init, /* tx_pa_en */
    .tsm_timing_27_init_32mhz = TSM_TIMING27init,
    .tsm_timing_28_init_32mhz = TSM_TIMING28init,
    .tsm_timing_29_init_32mhz = TSM_TIMING29init,
    
    .tsm_timing_30_init_32mhz = TSM_TIMING30init,
    .tsm_timing_31_init_32mhz = TSM_TIMING31init,
    .tsm_timing_32_init_32mhz = TSM_TIMING32init,
    .tsm_timing_33_init_32mhz = TSM_TIMING33init,
    .tsm_timing_34_init =       TSM_TIMING34init, /* pll_dig_en */
    .tsm_timing_35_init =       TSM_TIMING35init, /* tx_dig_en  */
    .tsm_timing_36_init_32mhz = TSM_TIMING36init,
    .tsm_timing_37_init_32mhz = TSM_TIMING37init,
    .tsm_timing_38_init =       TSM_TIMING38init, /* sigma_delta_en */
    .tsm_timing_39_init_32mhz = TSM_TIMING39init,
    
    .tsm_timing_40_init_32mhz = TSM_TIMING40init,
    .tsm_timing_41_init_32mhz = TSM_TIMING41init,
    /* TSM_TIMING_43.. TSM_TIMING_51 are SPARE and GPIO_TRIG signals */
    .tsm_timing_51_init =       TSM_TIMING51init, /* rxtx_auxpll_bias_en */
    .tsm_timing_52_init_32mhz = TSM_TIMING52init,
    .tsm_timing_53_init =       TSM_TIMING53init, /* rxtx_auxpll_lf_pd_en */
    .tsm_timing_54_init_32mhz = TSM_TIMING54init,
    .tsm_timing_55_init_32mhz = TSM_TIMING55init,
    .tsm_timing_56_init_32mhz = TSM_TIMING56init,
    .tsm_timing_57_init =       TSM_TIMING57init, /*rxtx_rccal_en  */
    .tsm_timing_58_init =       TSM_TIMING58init, /* tx_hpm_dac_en */


/* duplicate timings assigned above into 26mhz storage to allow fsl_xcvr.c to apply them */
/* this preserves compatibility between the Gen2 and Gen3 init value storage */
    .tsm_timing_14_init_26mhz = TSM_TIMING14init, /* sy_pd_cycle_slip_ld_ft_en */
    .tsm_timing_16_init_26mhz = TSM_TIMING16init, /* sy_lo_rx_buf_en */
    .tsm_timing_25_init_26mhz = TSM_TIMING25init, /* rx_lna_mixer_en */
    .tsm_timing_27_init_26mhz = TSM_TIMING27init, /* rx_adc_i_q_en */
    .tsm_timing_28_init_26mhz = TSM_TIMING28init, /* rx_adc_reset_en */
    .tsm_timing_29_init_26mhz = TSM_TIMING29init, /* rx_bba_i_q_en */
    .tsm_timing_30_init_26mhz = TSM_TIMING30init, /* rx_bba_pdet_en */
    .tsm_timing_31_init_26mhz = TSM_TIMING31init, /* rx_bba_tza_dcoc_en */
    .tsm_timing_32_init_26mhz = TSM_TIMING32init, /* rx_tza_i_q_en */
    .tsm_timing_33_init_26mhz = TSM_TIMING33init, /* rx_tza_pdet_en */
    .tsm_timing_36_init_26mhz = TSM_TIMING36init, /* rx_dig_en */
    .tsm_timing_37_init_26mhz = TSM_TIMING37init, /* rx_init */
    .tsm_timing_39_init_26mhz = TSM_TIMING39init, /* rx_phy_en */
    .tsm_timing_40_init_26mhz = TSM_TIMING40init, /* dcoc_en */
    .tsm_timing_41_init_26mhz = TSM_TIMING41init, /* dcoc_init */
    .tsm_timing_52_init_26mhz = TSM_TIMING52init, /* rxtx_auxpll_fcal_en */
    .tsm_timing_54_init_26mhz = TSM_TIMING54init, /* rxtx_auxpll_pd_lf_filter_charge_en */
    .tsm_timing_55_init_26mhz = TSM_TIMING55init, /* rxtx_auxpll_adc_buf_en */
    .tsm_timing_56_init_26mhz = TSM_TIMING56init, /* rxtx_auxpll_dig_buf_en */
#else /* Gen 2.0 */
    .pa_ramp_tbl_0_init = XCVR_TSM_PA_RAMP_TBL0_PA_RAMP0(PA_RAMP_0) | XCVR_TSM_PA_RAMP_TBL0_PA_RAMP1(PA_RAMP_1) |
                          XCVR_TSM_PA_RAMP_TBL0_PA_RAMP2(PA_RAMP_2) | XCVR_TSM_PA_RAMP_TBL0_PA_RAMP3(PA_RAMP_3),
    .pa_ramp_tbl_1_init = XCVR_TSM_PA_RAMP_TBL1_PA_RAMP4(PA_RAMP_4) | XCVR_TSM_PA_RAMP_TBL1_PA_RAMP5(PA_RAMP_5) |
                          XCVR_TSM_PA_RAMP_TBL1_PA_RAMP6(PA_RAMP_6) | XCVR_TSM_PA_RAMP_TBL1_PA_RAMP7(PA_RAMP_7),

